panpawel88/weather-triggered-pin-control/tools/test_apps/weather_test/sdkconfig.defaults
# Weather Test Application - sdkconfig defaults

# Inherit location configuration from main project
# These can be modified via menuconfig if needed

# Default ESP32-S3 target
CONFIG_IDF_TARGET="esp32s3"

# Increase stack size for HTTPS/TLS operations with certificate verification
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Disable MPI interrupt mode to avoid interrupt allocation issues
CONFIG_MBEDTLS_MPI_USE_INTERRUPT=n
